# 1
'''

Виконайте перетворення значення температури у градусах Цельсія (С) для інших температурних шкал: Фаренгейта (F) і Кельвіна (K). Програма повинна відображати еквівалентну температуру у градусах Фаренгейта (F = 32 + 9/5 * C) і у градусах Кельвіна (K = C + 273,15).

Вхідні дані:

25
Вихідні дані:

25 Celsius = 77.000 Fahrenheit = 298.150 Kelvin

'''

'''C = float(input("Enter temp in C: "))

F = 32 + 9/5 * C
K = C + 273.15

print(f'25 Celsius = {F:.3f} Fahrenheit = {K:.3f} Kelvin')'''

# 25 Celsius = 77.000 Fahrenheit = 298.150 Kelvin

# 2
'''
Отримати реверсний (в зворотному порядку) запис введеного користувачем трицифрового числа.

Вхідні дані:

184
Вихідні дані:

481
Розділ: ЗМІННІ І ТИПИ ДАНИХ | Рівень складності: СЕРЕДНІЙ
'''

'''numb = input("Enter a three-digit number: ") # 123

reverse_numb = numb[::-1]
print(reverse_numb) # 321

print(int(reverse_numb)) # 321
'''

